pages/rcdpp-2020-05.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-20 Wed 12:20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Intro to React Component Driver</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Donatas Petrauskas">
</head>
<body>
<div id="content">
<h1 class="title">Intro to React Component Driver
<br>
<span class="subtitle">Prezentacija Praktikantams</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf2bd457">1. React Component Driver</a></li>
<li><a href="#orgf28c452">2. Agenda</a></li>
<li><a href="#orgdbd6409">3. Kas yra React Component Driver?</a></li>
<li><a href="#org696c757">4. Panašūs įrankiai</a></li>
<li><a href="#orgb82fff8">5. Istorija</a></li>
<li><a href="#org55b7db4">6. Ko nedaro React Component Driver</a></li>
<li><a href="#org9310beb">7. Demo: React Test Renderer</a></li>
<li><a href="#org7ed6cba">8. Komponento Evoliucija</a></li>
<li><a href="#org320cdec">9. Demo: React Component Driver</a></li>
<li><a href="#org646611d">10. Ateities Vizija</a></li>
<li><a href="#org1767d6d">11. Dokumentacija</a></li>
<li><a href="#orgb97faa9">12. REPL</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf2bd457" class="outline-2">
<h2 id="orgf2bd457"><span class="section-number-2">1</span> React Component Driver</h2>
<div class="outline-text-2" id="text-1">
<p>
(╯°□°)╯︵ ┻━┻
</p>
</div>
</div>

<div id="outline-container-orgf28c452" class="outline-2">
<h2 id="orgf28c452"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Istorija</li>

<li>Demo: Read Test Renderer</li>

<li>Demo: React Component Driver <del>ir TDD</del></li>

<li>Ateities Vizija</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbd6409" class="outline-2">
<h2 id="orgdbd6409"><span class="section-number-2">3</span> Kas yra React Component Driver?</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://reactjs.org/docs/test-renderer.html">React Test Renderer</a> apvalkalas.</li>

<li>Įrankių rinkinys leidžiantis analizuoti komponentų medį.

<ul class="org-ul">
<li>Konstravimas: render, renderComponent, &#x2026;</li>

<li>Užklausos: filterBy, getTextNodes, &#x2026;</li>
</ul></li>

<li>Test Driver konvencija.

<ul class="org-ul">
<li>Paslepia komplikuotą konstravimą, manipuliavimą.</li>

<li>Pasakoja istoriją.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org696c757" class="outline-2">
<h2 id="org696c757"><span class="section-number-2">4</span> Panašūs įrankiai</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://github.com/enzymejs/enzyme">Enzyme</a></li>

<li><a href="https://github.com/testing-library/native-testing-library">React Testing Library</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb82fff8" class="outline-2">
<h2 id="orgb82fff8"><span class="section-number-2">5</span> Istorija</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
commit 93e02b2044d3f82ac7526449ec72ca7acd088840
Author: Donatas Petrauskas &lt;donatasp@wix.com&gt;
Date:   Mon Nov 21 16:17:19 2016 +0200

  Try to include custom built testkit.
</pre>
</div>
</div>

<div id="outline-container-org55b7db4" class="outline-2">
<h2 id="org55b7db4"><span class="section-number-2">6</span> Ko nedaro React Component Driver</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Nevykdo native kodo. Tam skirtas <a href="https://github.com/wix/detox">Detox</a>.</li>

<li>Nepalengvina testų rašymo.</li>
</ul>
</div>
</div>

<div id="outline-container-org9310beb" class="outline-2">
<h2 id="org9310beb"><span class="section-number-2">7</span> Demo: React Test Renderer</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Importavimas</li>

<li>Renderer objektas</li>

<li>Komponentų medis</li>

<li>Komponento evoliucija</li>
</ul>
</div>
</div>

<div id="outline-container-org7ed6cba" class="outline-2">
<h2 id="org7ed6cba"><span class="section-number-2">8</span> Komponento Evoliucija</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">Counter</span>() {
  <span class="org-keyword">const</span> [<span class="org-variable-name">count</span>, <span class="org-variable-name">setCount</span>] = React.useState(0);
  <span class="org-keyword">return</span> (&lt;button onClick={() =&gt; setCount(count + 1)}&gt;Count is {count}&lt;/button&gt;);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org320cdec" class="outline-2">
<h2 id="org320cdec"><span class="section-number-2">9</span> Demo: React Component Driver</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Užklausos</li>

<li><code>ComponentDriver</code></li>
</ul>
</div>
</div>

<div id="outline-container-org646611d" class="outline-2">
<h2 id="org646611d"><span class="section-number-2">10</span> Ateities Vizija</h2>
</div>

<div id="outline-container-org1767d6d" class="outline-2">
<h2 id="org1767d6d"><span class="section-number-2">11</span> Dokumentacija</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="https://github.com/wix-incubator/react-component-driver/blob/master/react-component-driver/README.org">React Component Driver</a>
</p>
</div>
</div>
<div id="outline-container-orgb97faa9" class="outline-2">
<h2 id="orgb97faa9"><span class="section-number-2">12</span> REPL</h2>
<div class="outline-text-2" id="text-12">
<pre class="example">
babel &gt; const React = require('react')
undefined
babel &gt; const {create} = require('react-test-renderer')
undefined
babel &gt; const pp = (x) =&gt; console.log(JSON.stringify(x, null, 2))
undefined
babel &gt; create(&lt;div /&gt;).toJSON()
{ type: 'div', props: {}, children: null }
babel &gt; create(&lt;div id="app" /&gt;).toJSON()
{ type: 'div', props: { id: 'app' }, children: null }
babel &gt; create(&lt;div&gt;Hello, World!&lt;/div&gt;).toJSON()
{ type: 'div', props: {}, children: [ 'Hello, World!' ] }
babel &gt; pp(create(&lt;div&gt;&lt;span&gt;Hello, World!&lt;/span&gt;&lt;button/&gt;&lt;/div&gt;).toJSON())
{
  "type": "div",
  "props": {},
  "children": [
    {
      "type": "span",
      "props": {},
      "children": [
        "Hello, World!"
      ]
    },
    {
      "type": "button",
      "props": {},
      "children": null
    }
  ]
}
undefined
babel &gt; const onClick = () =&gt; console.log('Hello!')
undefined
babel &gt; const button = create(&lt;button onClick={onClick}&gt;Click Me!&lt;/button&gt;).toJSON()
undefined
babel &gt; button.props.onClick()
Hello!
undefined
babel &gt; function Counter() {
  const [count, setCount] = React.useState(0);
  return (&lt;button onClick={() =&gt; setCount(count + 1)}&gt;Count is {count}&lt;/button&gt;);
}
undefined
babel &gt; const renderer = create(&lt;Counter /&gt;)
undefined
babel &gt; renderer.toJSON()
{
  type: 'button',
  props: { onClick: [Function: onClick] },
  children: [ 'Count is ', '0' ]
}
babel &gt; renderer.toJSON().props.onClick()
undefined
babel &gt; renderer.toJSON()
{
  type: 'button',
  props: { onClick: [Function: onClick] },
  children: [ 'Count is ', '1' ]
}
babel &gt; const RCD = require('react-component-driver')
undefined
babel &gt; RCD
{
  withContext: [Function: withContext],
  ComponentDriver: [Function: ComponentDriver],
  componentDriver: [Function: factory],
  render: [Function: render],
  renderComponent: [Function: renderComponent],
  toJSON: [Function: toJSON],
  filterBy: [Function: filterBy],
  filterByTestID: [Function: filterByTestID],
  filterByType: [Function: filterByType],
  getTextNodes: [Function: getTextNodes]
}
babel &gt; const {filterByTestID, filterBy, getTextNodes, renderComponent, toJSON, ComponentDriver} = RCD
undefined
babel &gt; renderComponent(Counter, {}).toJSON()
{
  type: 'button',
  props: { onClick: [Function: onClick] },
  children: [ 'Count is ', '0' ]
}
babel &gt; toJSON(renderComponent(Counter, {}))
{
  type: 'button',
  props: { onClick: [Function] },
  children: [ 'Count is ', '0' ]
}
babel &gt; function Counter() {
  const [count, setCount] = React.useState(0);
  return (
    &lt;div&gt;
      &lt;div testID="COUNT"&gt;{count}&lt;/div&gt;
      &lt;button testID="COUNTER_BUTTON" onClick={() =&gt; setCount(count + 1)}&gt;+&lt;/button&gt;
    &lt;/div&gt;
  );
}
undefined
babel &gt; const r = renderComponent(Counter, {})
undefined
babel &gt; const x = toJSON(r)
undefined
babel &gt; pp(x)
{
  "type": "div",
  "props": {},
  "children": [
    "       ",
    {
      "type": "div",
      "props": {
        "testID": "COUNT"
      },
      "children": [
        "0"
      ]
    },
    "       ",
    {
      "type": "button",
      "props": {
        "testID": "COUNTER_BUTTON"
      },
      "children": [
        "+"
      ]
    },
    "     "
  ]
}
undefined
babel &gt; filterByTestID('COUNT', x)
[ { type: 'div', props: { testID: 'COUNT' }, children: [ '0' ] } ]
babel &gt; filterByTestID('X', x)
[]
babel &gt; getTextNodes(filterByTestID('COUNT', x))
[ '0' ]
babel &gt; filterByTestID('COUNTER_BUTTON', x)[0].props.onClick()
undefined
babel &gt; pp(filterByTestID('COUNT', toJSON(r)))
[
  {
    "type": "div",
    "props": {
      "testID": "COUNT"
    },
    "children": [
      "1"
    ]
  }
]
undefined
babel &gt; const CounterDriver = class extends ComponentDriver {
  constructor() {
    super(Counter);
  }

  clickPlusButton() {
    this.getByID('COUNTER_BUTTON').props.onClick();
    return this;
  }

  getCount() {
    return this.getByID('COUNT').children[0];
  }
}
undefined
babel &gt; new CounterDriver().clickPlusButton().clickPlusButton().getCount()
'2'
babel &gt;
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<nav id="navigation">
  <button id="nav-menu">☰</button>
  <button id="nav-close">&times;</button>
  <ul>
    <li><a href="../index.html">Home</a></li>
  </ul>
</nav>
</div>
</body>
</html>
